---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
source: html/1c938b83-7dc9-e81e-e879-0e9c7a55dea6.htm
---
# RebarShapeConstraintChordLength Methods

Return the Id of the parameter associated with this constraint.